Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm064.h
extern volatile __RPINR7bits_t RPINR7bits __asm__ ("RPINR7") __attribute__((section("sfrs"), address(0xBF802A80)));
extern volatile uint32_t        RPINR7CLR __attribute__((section("sfrs"),address(0xBF802A84)));
extern volatile uint32_t        RPINR7SET __attribute__((section("sfrs"),address(0xBF802A88)));
extern volatile uint32_t        RPINR7INV __attribute__((section("sfrs"),address(0xBF802A8C)));
#define RPINR8 RPINR8
extern volatile uint32_t   RPINR8 __attribute__((section("sfrs"), address(0xBF802A90)));
typedef struct {
  uint32_t ICM9R:5;
  uint32_t :19;
  uint32_t U3RXR:5;
} __RPINR8bits_t;
extern volatile __RPINR8bits_t RPINR8bits __asm__ ("RPINR8") __attribute__((section("sfrs"), address(0xBF802A90)));
extern volatile uint32_t        RPINR8CLR __attribute__((section("sfrs"),address(0xBF802A94)));
extern volatile uint32_t        RPINR8SET __attribute__((section("sfrs"),address(0xBF802A98)));
extern volatile uint32_t        RPINR8INV __attribute__((section("sfrs"),address(0xBF802A9C)));
#define RPINR9 RPINR9
extern volatile uint32_t   RPINR9 __attribute__((section("sfrs"), address(0xBF802AA0)));
typedef struct {
  uint32_t :16;
  uint32_t U2RXR:5;
  uint32_t :3;
  uint32_t U2CTSR:5;
} __RPINR9bits_t;
extern volatile __RPINR9bits_t RPINR9bits __asm__ ("RPINR9") __attribute__((section("sfrs"), address(0xBF802AA0)));
extern volatile uint32_t        RPINR9CLR __attribute__((section("sfrs"),address(0xBF802AA4)));
extern volatile uint32_t        RPINR9SET __attribute__((section("sfrs"),address(0xBF802AA8)));
extern volatile uint32_t        RPINR9INV __attribute__((section("sfrs"),address(0xBF802AAC)));
#define RPINR10 RPINR10
extern volatile uint32_t   RPINR10 __attribute__((section("sfrs"), address(0xBF802AB0)));
typedef struct {
  uint32_t :24;
  uint32_t U3CTSR:5;
} __RPINR10bits_t;
extern volatile __RPINR10bits_t RPINR10bits __asm__ ("RPINR10") __attribute__((section("sfrs"), address(0xBF802AB0)));
extern volatile uint32_t        RPINR10CLR __attribute__((section("sfrs"),address(0xBF802AB4)));
extern volatile uint32_t        RPINR10SET __attribute__((section("sfrs"),address(0xBF802AB8)));
extern volatile uint32_t        RPINR10INV __attribute__((section("sfrs"),address(0xBF802ABC)));
#define RPINR11 RPINR11
extern volatile uint32_t   RPINR11 __attribute__((section("sfrs"), address(0xBF802AC0)));
typedef struct {
  uint32_t SDI2R:5;
  uint32_t :3;
  uint32_t SCK2INR:5;
  uint32_t :3;
  uint32_t SS2INR:5;
} __RPINR11bits_t;
extern volatile __RPINR11bits_t RPINR11bits __asm__ ("RPINR11") __attribute__((section("sfrs"), address(0xBF802AC0)));
extern volatile uint32_t        RPINR11CLR __attribute__((section("sfrs"),address(0xBF802AC4)));
extern volatile uint32_t        RPINR11SET __attribute__((section("sfrs"),address(0xBF802AC8)));
extern volatile uint32_t        RPINR11INV __attribute__((section("sfrs"),address(0xBF802ACC)));
#define RPINR12 RPINR12
extern volatile uint32_t   RPINR12 __attribute__((section("sfrs"), address(0xBF802AD0)));
typedef struct {
  uint32_t :16;
  uint32_t CLCINAR:5;
  uint32_t :3;
  uint32_t CLCINBR:5;
} __RPINR12bits_t;
extern volatile __RPINR12bits_t RPINR12bits __asm__ ("RPINR12") __attribute__((section("sfrs"), address(0xBF802AD0)));
extern volatile uint32_t        RPINR12CLR __attribute__((section("sfrs"),address(0xBF802AD4)));
extern volatile uint32_t        RPINR12SET __attribute__((section("sfrs"),address(0xBF802AD8)));
extern volatile uint32_t        RPINR12INV __attribute__((section("sfrs"),address(0xBF802ADC)));
#define RPOR0 RPOR0
extern volatile uint32_t   RPOR0 __attribute__((section("sfrs"), address(0xBF802B10)));
typedef struct {
  uint32_t RP1R:5;
  uint32_t :3;
  uint32_t RP2R:5;
  uint32_t :3;
  uint32_t RP3R:5;
  uint32_t :3;
  uint32_t RP4R:5;
} __RPOR0bits_t;
extern volatile __RPOR0bits_t RPOR0bits __asm__ ("RPOR0") __attribute__((section("sfrs"), address(0xBF802B10)));
extern volatile uint32_t        RPOR0CLR __attribute__((section("sfrs"),address(0xBF802B14)));
extern volatile uint32_t        RPOR0SET __attribute__((section("sfrs"),address(0xBF802B18)));
extern volatile uint32_t        RPOR0INV __attribute__((section("sfrs"),address(0xBF802B1C)));
#define RPOR1 RPOR1
extern volatile uint32_t   RPOR1 __attribute__((section("sfrs"), address(0xBF802B20)));
typedef struct {
  uint32_t RP5R:5;
  uint32_t :3;
  uint32_t RP6R:5;
  uint32_t :3;
  uint32_t RP7R:5;
  uint32_t :3;
  uint32_t RP8R:5;
} __RPOR1bits_t;
extern volatile __RPOR1bits_t RPOR1bits __asm__ ("RPOR1") __attribute__((section("sfrs"), address(0xBF802B20)));
extern volatile uint32_t        RPOR1CLR __attribute__((section("sfrs"),address(0xBF802B24)));
extern volatile uint32_t        RPOR1SET __attribute__((section("sfrs"),address(0xBF802B28)));
extern volatile uint32_t        RPOR1INV __attribute__((section("sfrs"),address(0xBF802B2C)));
#define RPOR2 RPOR2
extern volatile uint32_t   RPOR2 __attribute__((section("sfrs"), address(0xBF802B30)));
typedef struct {
  uint32_t RP9R:5;
  uint32_t :3;
  uint32_t RP10R:5;
  uint32_t :3;
  uint32_t RP11R:5;
  uint32_t :3;
  uint32_t RP12R:5;
} __RPOR2bits_t;
extern volatile __RPOR2bits_t RPOR2bits __asm__ ("RPOR2") __attribute__((section("sfrs"), address(0xBF802B30)));
extern volatile uint32_t        RPOR2CLR __attribute__((section("sfrs"),address(0xBF802B34)));
extern volatile uint32_t        RPOR2SET __attribute__((section("sfrs"),address(0xBF802B38)));
extern volatile uint32_t        RPOR2INV __attribute__((section("sfrs"),address(0xBF802B3C)));
#define RPOR3 RPOR3
extern volatile uint32_t   RPOR3 __attribute__((section("sfrs"), address(0xBF802B40)));
typedef struct {
  uint32_t RP13R:5;
  uint32_t :3;
  uint32_t RP14R:5;
  uint32_t :3;
  uint32_t RP15R:5;
  uint32_t :3;
  uint32_t RP16R:5;
} __RPOR3bits_t;
extern volatile __RPOR3bits_t RPOR3bits __asm__ ("RPOR3") __attribute__((section("sfrs"), address(0xBF802B40)));
extern volatile uint32_t        RPOR3CLR __attribute__((section("sfrs"),address(0xBF802B44)));
extern volatile uint32_t        RPOR3SET __attribute__((section("sfrs"),address(0xBF802B48)));
extern volatile uint32_t        RPOR3INV __attribute__((section("sfrs"),address(0xBF802B4C)));
#define RPOR4 RPOR4
extern volatile uint32_t   RPOR4 __attribute__((section("sfrs"), address(0xBF802B50)));
typedef struct {
  uint32_t RP17R:5;
  uint32_t :3;
  uint32_t RP18R:5;
  uint32_t :3;
  uint32_t RP19R:5;
  uint32_t :3;
  uint32_t RP20R:5;
} __RPOR4bits_t;
extern volatile __RPOR4bits_t RPOR4bits __asm__ ("RPOR4") __attribute__((section("sfrs"), address(0xBF802B50)));
extern volatile uint32_t        RPOR4CLR __attribute__((section("sfrs"),address(0xBF802B54)));
extern volatile uint32_t        RPOR4SET __attribute__((section("sfrs"),address(0xBF802B58)));
extern volatile uint32_t        RPOR4INV __attribute__((section("sfrs"),address(0xBF802B5C)));
#define RPOR5 RPOR5
extern volatile uint32_t   RPOR5 __attribute__((section("sfrs"), address(0xBF802B60)));
typedef struct {
  uint32_t RP21R:5;
  uint32_t :3;
  uint32_t RP22R:5;
  uint32_t :3;
  uint32_t RP23R:5;
  uint32_t :3;
  uint32_t RP24R:5;
} __RPOR5bits_t;
extern volatile __RPOR5bits_t RPOR5bits __asm__ ("RPOR5") __attribute__((section("sfrs"), address(0xBF802B60)));
extern volatile uint32_t        RPOR5CLR __attribute__((section("sfrs"),address(0xBF802B64)));
extern volatile uint32_t        RPOR5SET __attribute__((section("sfrs"),address(0xBF802B68)));
extern volatile uint32_t        RPOR5INV __attribute__((section("sfrs"),address(0xBF802B6C)));
#define ANSELA ANSELA
extern volatile uint32_t   ANSELA __attribute__((section("sfrs"), address(0xBF802BB0)));
typedef struct {
  uint32_t ANSA0:1;
  uint32_t ANSA1:1;
  uint32_t ANSA2:1;
  uint32_t ANSA3:1;
  uint32_t :2;
  uint32_t ANSA6:1;
  uint32_t :4;
  uint32_t ANSA11:1;
  uint32_t ANSA12:1;
  uint32_t ANSA13:1;
} __ANSELAbits_t;
