Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm064.h
extern volatile __U1EP13bits_t U1EP13bits __asm__ ("U1EP13") __attribute__((section("sfrs"), address(0xBF8087D0)));
extern volatile uint32_t        U1EP13CLR __attribute__((section("sfrs"),address(0xBF8087D4)));
extern volatile uint32_t        U1EP13SET __attribute__((section("sfrs"),address(0xBF8087D8)));
extern volatile uint32_t        U1EP13INV __attribute__((section("sfrs"),address(0xBF8087DC)));
#define U1EP14 U1EP14
extern volatile uint32_t   U1EP14 __attribute__((section("sfrs"), address(0xBF8087E0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP14bits_t;
extern volatile __U1EP14bits_t U1EP14bits __asm__ ("U1EP14") __attribute__((section("sfrs"), address(0xBF8087E0)));
extern volatile uint32_t        U1EP14CLR __attribute__((section("sfrs"),address(0xBF8087E4)));
extern volatile uint32_t        U1EP14SET __attribute__((section("sfrs"),address(0xBF8087E8)));
extern volatile uint32_t        U1EP14INV __attribute__((section("sfrs"),address(0xBF8087EC)));
#define U1EP15 U1EP15
extern volatile uint32_t   U1EP15 __attribute__((section("sfrs"), address(0xBF8087F0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP15bits_t;
extern volatile __U1EP15bits_t U1EP15bits __asm__ ("U1EP15") __attribute__((section("sfrs"), address(0xBF8087F0)));
extern volatile uint32_t        U1EP15CLR __attribute__((section("sfrs"),address(0xBF8087F4)));
extern volatile uint32_t        U1EP15SET __attribute__((section("sfrs"),address(0xBF8087F8)));
extern volatile uint32_t        U1EP15INV __attribute__((section("sfrs"),address(0xBF8087FC)));
#define DMACON DMACON
extern volatile uint32_t   DMACON __attribute__((section("sfrs"), address(0xBF808900)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t DMABUSY:1;
    uint32_t SUSPEND:1;
    uint32_t :2;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __DMACONbits_t;
extern volatile __DMACONbits_t DMACONbits __asm__ ("DMACON") __attribute__((section("sfrs"), address(0xBF808900)));
extern volatile uint32_t        DMACONCLR __attribute__((section("sfrs"),address(0xBF808904)));
extern volatile uint32_t        DMACONSET __attribute__((section("sfrs"),address(0xBF808908)));
extern volatile uint32_t        DMACONINV __attribute__((section("sfrs"),address(0xBF80890C)));
#define DMASTAT DMASTAT
extern volatile uint32_t   DMASTAT __attribute__((section("sfrs"), address(0xBF808910)));
typedef union {
  struct {
    uint32_t DMACH:3;
    uint32_t RDWR:1;
  };
  struct {
    uint32_t w:32;
  };
} __DMASTATbits_t;
extern volatile __DMASTATbits_t DMASTATbits __asm__ ("DMASTAT") __attribute__((section("sfrs"), address(0xBF808910)));
extern volatile uint32_t        DMASTATCLR __attribute__((section("sfrs"),address(0xBF808914)));
extern volatile uint32_t        DMASTATSET __attribute__((section("sfrs"),address(0xBF808918)));
extern volatile uint32_t        DMASTATINV __attribute__((section("sfrs"),address(0xBF80891C)));
#define DMAADDR DMAADDR
extern volatile uint32_t   DMAADDR __attribute__((section("sfrs"), address(0xBF808920)));
extern volatile uint32_t        DMAADDRCLR __attribute__((section("sfrs"),address(0xBF808924)));
extern volatile uint32_t        DMAADDRSET __attribute__((section("sfrs"),address(0xBF808928)));
extern volatile uint32_t        DMAADDRINV __attribute__((section("sfrs"),address(0xBF80892C)));
#define DCRCCON DCRCCON
extern volatile uint32_t   DCRCCON __attribute__((section("sfrs"), address(0xBF808930)));
typedef union {
  struct {
    uint32_t CRCCH:3;
    uint32_t :2;
    uint32_t CRCTYP:1;
    uint32_t CRCAPP:1;
    uint32_t CRCEN:1;
    uint32_t PLEN:5;
    uint32_t :11;
    uint32_t BITO:1;
    uint32_t :2;
    uint32_t WBO:1;
    uint32_t BYTO:2;
  };
  struct {
    uint32_t w:32;
  };
} __DCRCCONbits_t;
extern volatile __DCRCCONbits_t DCRCCONbits __asm__ ("DCRCCON") __attribute__((section("sfrs"), address(0xBF808930)));
extern volatile uint32_t        DCRCCONCLR __attribute__((section("sfrs"),address(0xBF808934)));
extern volatile uint32_t        DCRCCONSET __attribute__((section("sfrs"),address(0xBF808938)));
extern volatile uint32_t        DCRCCONINV __attribute__((section("sfrs"),address(0xBF80893C)));
#define DCRCDATA DCRCDATA
extern volatile uint32_t   DCRCDATA __attribute__((section("sfrs"), address(0xBF808940)));
extern volatile uint32_t        DCRCDATACLR __attribute__((section("sfrs"),address(0xBF808944)));
extern volatile uint32_t        DCRCDATASET __attribute__((section("sfrs"),address(0xBF808948)));
extern volatile uint32_t        DCRCDATAINV __attribute__((section("sfrs"),address(0xBF80894C)));
#define DCRCXOR DCRCXOR
extern volatile uint32_t   DCRCXOR __attribute__((section("sfrs"), address(0xBF808950)));
extern volatile uint32_t        DCRCXORCLR __attribute__((section("sfrs"),address(0xBF808954)));
extern volatile uint32_t        DCRCXORSET __attribute__((section("sfrs"),address(0xBF808958)));
extern volatile uint32_t        DCRCXORINV __attribute__((section("sfrs"),address(0xBF80895C)));
#define DCH0CON DCH0CON
extern volatile uint32_t   DCH0CON __attribute__((section("sfrs"), address(0xBF808960)));
typedef union {
  struct {
    uint32_t CHPRI:2;
    uint32_t CHEDET:1;
    uint32_t :1;
    uint32_t CHAEN:1;
    uint32_t CHCHN:1;
    uint32_t CHAED:1;
    uint32_t CHEN:1;
    uint32_t CHCHNS:1;
    uint32_t :6;
    uint32_t CHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH0CONbits_t;
extern volatile __DCH0CONbits_t DCH0CONbits __asm__ ("DCH0CON") __attribute__((section("sfrs"), address(0xBF808960)));
extern volatile uint32_t        DCH0CONCLR __attribute__((section("sfrs"),address(0xBF808964)));
extern volatile uint32_t        DCH0CONSET __attribute__((section("sfrs"),address(0xBF808968)));
extern volatile uint32_t        DCH0CONINV __attribute__((section("sfrs"),address(0xBF80896C)));
#define DCH0ECON DCH0ECON
extern volatile uint32_t   DCH0ECON __attribute__((section("sfrs"), address(0xBF808970)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t AIRQEN:1;
    uint32_t SIRQEN:1;
    uint32_t PATEN:1;
    uint32_t CABORT:1;
    uint32_t CFORCE:1;
    uint32_t CHSIRQ:8;
    uint32_t CHAIRQ:8;
  };
  struct {
    uint32_t w:32;
  };
} __DCH0ECONbits_t;
extern volatile __DCH0ECONbits_t DCH0ECONbits __asm__ ("DCH0ECON") __attribute__((section("sfrs"), address(0xBF808970)));
extern volatile uint32_t        DCH0ECONCLR __attribute__((section("sfrs"),address(0xBF808974)));
extern volatile uint32_t        DCH0ECONSET __attribute__((section("sfrs"),address(0xBF808978)));
extern volatile uint32_t        DCH0ECONINV __attribute__((section("sfrs"),address(0xBF80897C)));
#define DCH0INT DCH0INT
extern volatile uint32_t   DCH0INT __attribute__((section("sfrs"), address(0xBF808980)));
typedef union {
  struct {
    uint32_t CHERIF:1;
    uint32_t CHTAIF:1;
    uint32_t CHCCIF:1;
    uint32_t CHBCIF:1;
    uint32_t CHDHIF:1;
    uint32_t CHDDIF:1;
    uint32_t CHSHIF:1;
    uint32_t CHSDIF:1;
    uint32_t :8;
    uint32_t CHERIE:1;
    uint32_t CHTAIE:1;
    uint32_t CHCCIE:1;
    uint32_t CHBCIE:1;
    uint32_t CHDHIE:1;
    uint32_t CHDDIE:1;
    uint32_t CHSHIE:1;
    uint32_t CHSDIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __DCH0INTbits_t;
extern volatile __DCH0INTbits_t DCH0INTbits __asm__ ("DCH0INT") __attribute__((section("sfrs"), address(0xBF808980)));
extern volatile uint32_t        DCH0INTCLR __attribute__((section("sfrs"),address(0xBF808984)));
extern volatile uint32_t        DCH0INTSET __attribute__((section("sfrs"),address(0xBF808988)));
extern volatile uint32_t        DCH0INTINV __attribute__((section("sfrs"),address(0xBF80898C)));
#define DCH0SSA DCH0SSA
extern volatile uint32_t   DCH0SSA __attribute__((section("sfrs"), address(0xBF808990)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH0SSAbits_t;
