Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm064.h
#define _CCP1CON1_TMRSYNC_POSITION               0x0000000B
#define _CCP1CON1_TMRSYNC_MASK                   0x00000800
#define _CCP1CON1_TMRSYNC_LENGTH                 0x00000001

#define _CCP1CON1_CCPSLP_POSITION                0x0000000C
#define _CCP1CON1_CCPSLP_MASK                    0x00001000
#define _CCP1CON1_CCPSLP_LENGTH                  0x00000001

#define _CCP1CON1_SIDL_POSITION                  0x0000000D
#define _CCP1CON1_SIDL_MASK                      0x00002000
#define _CCP1CON1_SIDL_LENGTH                    0x00000001

#define _CCP1CON1_ON_POSITION                    0x0000000F
#define _CCP1CON1_ON_MASK                        0x00008000
#define _CCP1CON1_ON_LENGTH                      0x00000001

#define _CCP1CON1_SYNC_POSITION                  0x00000010
#define _CCP1CON1_SYNC_MASK                      0x001F0000
#define _CCP1CON1_SYNC_LENGTH                    0x00000005

#define _CCP1CON1_ALTSYNC_POSITION               0x00000015
#define _CCP1CON1_ALTSYNC_MASK                   0x00200000
#define _CCP1CON1_ALTSYNC_LENGTH                 0x00000001

#define _CCP1CON1_ONESHOT_POSITION               0x00000016
#define _CCP1CON1_ONESHOT_MASK                   0x00400000
#define _CCP1CON1_ONESHOT_LENGTH                 0x00000001

#define _CCP1CON1_TRIGEN_POSITION                0x00000017
#define _CCP1CON1_TRIGEN_MASK                    0x00800000
#define _CCP1CON1_TRIGEN_LENGTH                  0x00000001

#define _CCP1CON1_OPS_POSITION                   0x00000018
#define _CCP1CON1_OPS_MASK                       0x0F000000
#define _CCP1CON1_OPS_LENGTH                     0x00000004

#define _CCP1CON1_RTRGEN_POSITION                0x0000001E
#define _CCP1CON1_RTRGEN_MASK                    0x40000000
#define _CCP1CON1_RTRGEN_LENGTH                  0x00000001

#define _CCP1CON1_OPSSRC_POSITION                0x0000001F
#define _CCP1CON1_OPSSRC_MASK                    0x80000000
#define _CCP1CON1_OPSSRC_LENGTH                  0x00000001

#define _CCP1CON2_ASDG_POSITION                  0x00000000
#define _CCP1CON2_ASDG_MASK                      0x000000FF
#define _CCP1CON2_ASDG_LENGTH                    0x00000008

#define _CCP1CON2_SSDG_POSITION                  0x0000000C
#define _CCP1CON2_SSDG_MASK                      0x00001000
#define _CCP1CON2_SSDG_LENGTH                    0x00000001

#define _CCP1CON2_ASDGM_POSITION                 0x0000000E
#define _CCP1CON2_ASDGM_MASK                     0x00004000
#define _CCP1CON2_ASDGM_LENGTH                   0x00000001

#define _CCP1CON2_PWMRSEN_POSITION               0x0000000F
#define _CCP1CON2_PWMRSEN_MASK                   0x00008000
#define _CCP1CON2_PWMRSEN_LENGTH                 0x00000001

#define _CCP1CON2_ICS_POSITION                   0x00000010
#define _CCP1CON2_ICS_MASK                       0x00070000
#define _CCP1CON2_ICS_LENGTH                     0x00000003

#define _CCP1CON2_AUXOUT_POSITION                0x00000013
#define _CCP1CON2_AUXOUT_MASK                    0x00180000
#define _CCP1CON2_AUXOUT_LENGTH                  0x00000002

#define _CCP1CON2_ICGSM_POSITION                 0x00000016
#define _CCP1CON2_ICGSM_MASK                     0x00C00000
#define _CCP1CON2_ICGSM_LENGTH                   0x00000002

#define _CCP1CON2_OCAEN_POSITION                 0x00000018
#define _CCP1CON2_OCAEN_MASK                     0x01000000
#define _CCP1CON2_OCAEN_LENGTH                   0x00000001

#define _CCP1CON2_OCBEN_POSITION                 0x00000019
#define _CCP1CON2_OCBEN_MASK                     0x02000000
#define _CCP1CON2_OCBEN_LENGTH                   0x00000001

#define _CCP1CON2_OCCEN_POSITION                 0x0000001A
#define _CCP1CON2_OCCEN_MASK                     0x04000000
#define _CCP1CON2_OCCEN_LENGTH                   0x00000001

#define _CCP1CON2_OCDEN_POSITION                 0x0000001B
#define _CCP1CON2_OCDEN_MASK                     0x08000000
#define _CCP1CON2_OCDEN_LENGTH                   0x00000001

#define _CCP1CON2_OCEEN_POSITION                 0x0000001C
#define _CCP1CON2_OCEEN_MASK                     0x10000000
#define _CCP1CON2_OCEEN_LENGTH                   0x00000001

#define _CCP1CON2_OCFEN_POSITION                 0x0000001D
#define _CCP1CON2_OCFEN_MASK                     0x20000000
#define _CCP1CON2_OCFEN_LENGTH                   0x00000001

#define _CCP1CON2_OENSYNC_POSITION               0x0000001F
#define _CCP1CON2_OENSYNC_MASK                   0x80000000
#define _CCP1CON2_OENSYNC_LENGTH                 0x00000001

#define _CCP1CON3_DT_POSITION                    0x00000000
#define _CCP1CON3_DT_MASK                        0x0000003F
#define _CCP1CON3_DT_LENGTH                      0x00000006

#define _CCP1CON3_PSSBDF_POSITION                0x00000010
#define _CCP1CON3_PSSBDF_MASK                    0x00030000
#define _CCP1CON3_PSSBDF_LENGTH                  0x00000002

#define _CCP1CON3_PSSACE_POSITION                0x00000012
#define _CCP1CON3_PSSACE_MASK                    0x000C0000
#define _CCP1CON3_PSSACE_LENGTH                  0x00000002

#define _CCP1CON3_POLBDF_POSITION                0x00000014
#define _CCP1CON3_POLBDF_MASK                    0x00100000
#define _CCP1CON3_POLBDF_LENGTH                  0x00000001

#define _CCP1CON3_POLACE_POSITION                0x00000015
#define _CCP1CON3_POLACE_MASK                    0x00200000
#define _CCP1CON3_POLACE_LENGTH                  0x00000001

#define _CCP1CON3_OUTM_POSITION                  0x00000018
#define _CCP1CON3_OUTM_MASK                      0x07000000
#define _CCP1CON3_OUTM_LENGTH                    0x00000003

#define _CCP1CON3_OSCNT_POSITION                 0x0000001C
#define _CCP1CON3_OSCNT_MASK                     0x70000000
#define _CCP1CON3_OSCNT_LENGTH                   0x00000003

#define _CCP1CON3_OETRIG_POSITION                0x0000001F
#define _CCP1CON3_OETRIG_MASK                    0x80000000
#define _CCP1CON3_OETRIG_LENGTH                  0x00000001

#define _CCP1STAT_ICBNE_POSITION                 0x00000000
#define _CCP1STAT_ICBNE_MASK                     0x00000001
#define _CCP1STAT_ICBNE_LENGTH                   0x00000001

#define _CCP1STAT_ICOV_POSITION                  0x00000001
#define _CCP1STAT_ICOV_MASK                      0x00000002
#define _CCP1STAT_ICOV_LENGTH                    0x00000001

