Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm064.h
#define _CNEN1A_CNIE1A6_POSITION                 0x00000006
#define _CNEN1A_CNIE1A6_MASK                     0x00000040
#define _CNEN1A_CNIE1A6_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A7_POSITION                 0x00000007
#define _CNEN1A_CNIE1A7_MASK                     0x00000080
#define _CNEN1A_CNIE1A7_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A8_POSITION                 0x00000008
#define _CNEN1A_CNIE1A8_MASK                     0x00000100
#define _CNEN1A_CNIE1A8_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A9_POSITION                 0x00000009
#define _CNEN1A_CNIE1A9_MASK                     0x00000200
#define _CNEN1A_CNIE1A9_LENGTH                   0x00000001

#define _CNEN1A_CNIE1A10_POSITION                0x0000000A
#define _CNEN1A_CNIE1A10_MASK                    0x00000400
#define _CNEN1A_CNIE1A10_LENGTH                  0x00000001

#define _CNEN1A_CNIE1A11_POSITION                0x0000000B
#define _CNEN1A_CNIE1A11_MASK                    0x00000800
#define _CNEN1A_CNIE1A11_LENGTH                  0x00000001

#define _CNEN1A_CNIE1A12_POSITION                0x0000000C
#define _CNEN1A_CNIE1A12_MASK                    0x00001000
#define _CNEN1A_CNIE1A12_LENGTH                  0x00000001

#define _CNEN1A_CNIE1A13_POSITION                0x0000000D
#define _CNEN1A_CNIE1A13_MASK                    0x00002000
#define _CNEN1A_CNIE1A13_LENGTH                  0x00000001

#define _CNEN1A_CNIE1A14_POSITION                0x0000000E
#define _CNEN1A_CNIE1A14_MASK                    0x00004000
#define _CNEN1A_CNIE1A14_LENGTH                  0x00000001

#define _CNEN1A_CNIE1A15_POSITION                0x0000000F
#define _CNEN1A_CNIE1A15_MASK                    0x00008000
#define _CNEN1A_CNIE1A15_LENGTH                  0x00000001

#define _CNEN1A_w_POSITION                       0x00000000
#define _CNEN1A_w_MASK                           0xFFFFFFFF
#define _CNEN1A_w_LENGTH                         0x00000020

#define _CNFA_CNFA0_POSITION                     0x00000000
#define _CNFA_CNFA0_MASK                         0x00000001
#define _CNFA_CNFA0_LENGTH                       0x00000001

#define _CNFA_CNFA1_POSITION                     0x00000001
#define _CNFA_CNFA1_MASK                         0x00000002
#define _CNFA_CNFA1_LENGTH                       0x00000001

#define _CNFA_CNFA2_POSITION                     0x00000002
#define _CNFA_CNFA2_MASK                         0x00000004
#define _CNFA_CNFA2_LENGTH                       0x00000001

#define _CNFA_CNFA3_POSITION                     0x00000003
#define _CNFA_CNFA3_MASK                         0x00000008
#define _CNFA_CNFA3_LENGTH                       0x00000001

#define _CNFA_CNFA4_POSITION                     0x00000004
#define _CNFA_CNFA4_MASK                         0x00000010
#define _CNFA_CNFA4_LENGTH                       0x00000001

#define _CNFA_CNFA5_POSITION                     0x00000005
#define _CNFA_CNFA5_MASK                         0x00000020
#define _CNFA_CNFA5_LENGTH                       0x00000001

#define _CNFA_CNFA6_POSITION                     0x00000006
#define _CNFA_CNFA6_MASK                         0x00000040
#define _CNFA_CNFA6_LENGTH                       0x00000001

#define _CNFA_CNFA7_POSITION                     0x00000007
#define _CNFA_CNFA7_MASK                         0x00000080
#define _CNFA_CNFA7_LENGTH                       0x00000001

#define _CNFA_CNFA8_POSITION                     0x00000008
#define _CNFA_CNFA8_MASK                         0x00000100
#define _CNFA_CNFA8_LENGTH                       0x00000001

#define _CNFA_CNFA9_POSITION                     0x00000009
#define _CNFA_CNFA9_MASK                         0x00000200
#define _CNFA_CNFA9_LENGTH                       0x00000001

#define _CNFA_CNFA10_POSITION                    0x0000000A
#define _CNFA_CNFA10_MASK                        0x00000400
#define _CNFA_CNFA10_LENGTH                      0x00000001

#define _CNFA_CNFA11_POSITION                    0x0000000B
#define _CNFA_CNFA11_MASK                        0x00000800
#define _CNFA_CNFA11_LENGTH                      0x00000001

#define _CNFA_CNFA12_POSITION                    0x0000000C
#define _CNFA_CNFA12_MASK                        0x00001000
#define _CNFA_CNFA12_LENGTH                      0x00000001

#define _CNFA_CNFA13_POSITION                    0x0000000D
#define _CNFA_CNFA13_MASK                        0x00002000
#define _CNFA_CNFA13_LENGTH                      0x00000001

#define _CNFA_CNFA14_POSITION                    0x0000000E
#define _CNFA_CNFA14_MASK                        0x00004000
#define _CNFA_CNFA14_LENGTH                      0x00000001

#define _CNFA_CNFA15_POSITION                    0x0000000F
#define _CNFA_CNFA15_MASK                        0x00008000
#define _CNFA_CNFA15_LENGTH                      0x00000001

#define _CNFA_w_POSITION                         0x00000000
#define _CNFA_w_MASK                             0xFFFFFFFF
#define _CNFA_w_LENGTH                           0x00000020

#define _SR0A_w_POSITION                         0x00000000
#define _SR0A_w_MASK                             0xFFFFFFFF
#define _SR0A_w_LENGTH                           0x00000020

#define _SR1A_w_POSITION                         0x00000000
#define _SR1A_w_MASK                             0xFFFFFFFF
#define _SR1A_w_LENGTH                           0x00000020

#define _ANSELB_ANSB0_POSITION                   0x00000000
#define _ANSELB_ANSB0_MASK                       0x00000001
#define _ANSELB_ANSB0_LENGTH                     0x00000001

#define _ANSELB_ANSB1_POSITION                   0x00000001
#define _ANSELB_ANSB1_MASK                       0x00000002
#define _ANSELB_ANSB1_LENGTH                     0x00000001

#define _ANSELB_ANSB2_POSITION                   0x00000002
#define _ANSELB_ANSB2_MASK                       0x00000004
#define _ANSELB_ANSB2_LENGTH                     0x00000001

#define _ANSELB_ANSB3_POSITION                   0x00000003
#define _ANSELB_ANSB3_MASK                       0x00000008
#define _ANSELB_ANSB3_LENGTH                     0x00000001

#define _ANSELB_ANSB4_POSITION                   0x00000004
#define _ANSELB_ANSB4_MASK                       0x00000010
#define _ANSELB_ANSB4_LENGTH                     0x00000001

