Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm064.h
#define _IFS1_LVDIF_POSITION                     0x00000004
#define _IFS1_LVDIF_MASK                         0x00000010
#define _IFS1_LVDIF_LENGTH                       0x00000001

#define _IFS1_CLC1IF_POSITION                    0x00000005
#define _IFS1_CLC1IF_MASK                        0x00000020
#define _IFS1_CLC1IF_LENGTH                      0x00000001

#define _IFS1_CLC2IF_POSITION                    0x00000006
#define _IFS1_CLC2IF_MASK                        0x00000040
#define _IFS1_CLC2IF_LENGTH                      0x00000001

#define _IFS1_CLC3IF_POSITION                    0x00000007
#define _IFS1_CLC3IF_MASK                        0x00000080
#define _IFS1_CLC3IF_LENGTH                      0x00000001

#define _IFS1_CLC4IF_POSITION                    0x00000008
#define _IFS1_CLC4IF_MASK                        0x00000100
#define _IFS1_CLC4IF_LENGTH                      0x00000001

#define _IFS1_SPI1EIF_POSITION                   0x00000009
#define _IFS1_SPI1EIF_MASK                       0x00000200
#define _IFS1_SPI1EIF_LENGTH                     0x00000001

#define _IFS1_SPI1TXIF_POSITION                  0x0000000A
#define _IFS1_SPI1TXIF_MASK                      0x00000400
#define _IFS1_SPI1TXIF_LENGTH                    0x00000001

#define _IFS1_SPI1RXIF_POSITION                  0x0000000B
#define _IFS1_SPI1RXIF_MASK                      0x00000800
#define _IFS1_SPI1RXIF_LENGTH                    0x00000001

#define _IFS1_SPI2EIF_POSITION                   0x0000000C
#define _IFS1_SPI2EIF_MASK                       0x00001000
#define _IFS1_SPI2EIF_LENGTH                     0x00000001

#define _IFS1_SPI2TXIF_POSITION                  0x0000000D
#define _IFS1_SPI2TXIF_MASK                      0x00002000
#define _IFS1_SPI2TXIF_LENGTH                    0x00000001

#define _IFS1_SPI2RXIF_POSITION                  0x0000000E
#define _IFS1_SPI2RXIF_MASK                      0x00004000
#define _IFS1_SPI2RXIF_LENGTH                    0x00000001

#define _IFS1_SPI3EIF_POSITION                   0x0000000F
#define _IFS1_SPI3EIF_MASK                       0x00008000
#define _IFS1_SPI3EIF_LENGTH                     0x00000001

#define _IFS1_SPI3TXIF_POSITION                  0x00000010
#define _IFS1_SPI3TXIF_MASK                      0x00010000
#define _IFS1_SPI3TXIF_LENGTH                    0x00000001

#define _IFS1_SPI3RXIF_POSITION                  0x00000011
#define _IFS1_SPI3RXIF_MASK                      0x00020000
#define _IFS1_SPI3RXIF_LENGTH                    0x00000001

#define _IFS1_U1RXIF_POSITION                    0x00000015
#define _IFS1_U1RXIF_MASK                        0x00200000
#define _IFS1_U1RXIF_LENGTH                      0x00000001

#define _IFS1_U1TXIF_POSITION                    0x00000016
#define _IFS1_U1TXIF_MASK                        0x00400000
#define _IFS1_U1TXIF_LENGTH                      0x00000001

#define _IFS1_U1EIF_POSITION                     0x00000017
#define _IFS1_U1EIF_MASK                         0x00800000
#define _IFS1_U1EIF_LENGTH                       0x00000001

#define _IFS1_U2RXIF_POSITION                    0x00000018
#define _IFS1_U2RXIF_MASK                        0x01000000
#define _IFS1_U2RXIF_LENGTH                      0x00000001

#define _IFS1_U2TXIF_POSITION                    0x00000019
#define _IFS1_U2TXIF_MASK                        0x02000000
#define _IFS1_U2TXIF_LENGTH                      0x00000001

#define _IFS1_U2EIF_POSITION                     0x0000001A
#define _IFS1_U2EIF_MASK                         0x04000000
#define _IFS1_U2EIF_LENGTH                       0x00000001

#define _IFS1_U3RXIF_POSITION                    0x0000001B
#define _IFS1_U3RXIF_MASK                        0x08000000
#define _IFS1_U3RXIF_LENGTH                      0x00000001

#define _IFS1_U3TXIF_POSITION                    0x0000001C
#define _IFS1_U3TXIF_MASK                        0x10000000
#define _IFS1_U3TXIF_LENGTH                      0x00000001

#define _IFS1_U3EIF_POSITION                     0x0000001D
#define _IFS1_U3EIF_MASK                         0x20000000
#define _IFS1_U3EIF_LENGTH                       0x00000001

#define _IFS2_I2C1SIF_POSITION                   0x00000001
#define _IFS2_I2C1SIF_MASK                       0x00000002
#define _IFS2_I2C1SIF_LENGTH                     0x00000001

#define _IFS2_I2C1MIF_POSITION                   0x00000002
#define _IFS2_I2C1MIF_MASK                       0x00000004
#define _IFS2_I2C1MIF_LENGTH                     0x00000001

#define _IFS2_I2C1BCIF_POSITION                  0x00000003
#define _IFS2_I2C1BCIF_MASK                      0x00000008
#define _IFS2_I2C1BCIF_LENGTH                    0x00000001

#define _IFS2_I2C2SIF_POSITION                   0x00000004
#define _IFS2_I2C2SIF_MASK                       0x00000010
#define _IFS2_I2C2SIF_LENGTH                     0x00000001

#define _IFS2_I2C2MIF_POSITION                   0x00000005
#define _IFS2_I2C2MIF_MASK                       0x00000020
#define _IFS2_I2C2MIF_LENGTH                     0x00000001

#define _IFS2_I2C2BCIF_POSITION                  0x00000006
#define _IFS2_I2C2BCIF_MASK                      0x00000040
#define _IFS2_I2C2BCIF_LENGTH                    0x00000001

#define _IFS2_I2C3SIF_POSITION                   0x00000007
#define _IFS2_I2C3SIF_MASK                       0x00000080
#define _IFS2_I2C3SIF_LENGTH                     0x00000001

#define _IFS2_I2C3MIF_POSITION                   0x00000008
#define _IFS2_I2C3MIF_MASK                       0x00000100
#define _IFS2_I2C3MIF_LENGTH                     0x00000001

#define _IFS2_I2C3BCIF_POSITION                  0x00000009
#define _IFS2_I2C3BCIF_MASK                      0x00000200
#define _IFS2_I2C3BCIF_LENGTH                    0x00000001

#define _IFS2_CCP1IF_POSITION                    0x0000000A
#define _IFS2_CCP1IF_MASK                        0x00000400
#define _IFS2_CCP1IF_LENGTH                      0x00000001

#define _IFS2_CCT1IF_POSITION                    0x0000000B
#define _IFS2_CCT1IF_MASK                        0x00000800
#define _IFS2_CCT1IF_LENGTH                      0x00000001

#define _IFS2_CCP2IF_POSITION                    0x0000000C
#define _IFS2_CCP2IF_MASK                        0x00001000
#define _IFS2_CCP2IF_LENGTH                      0x00000001

#define _IFS2_CCT2IF_POSITION                    0x0000000D
#define _IFS2_CCT2IF_MASK                        0x00002000
#define _IFS2_CCT2IF_LENGTH                      0x00000001

#define _IFS2_CCP3IF_POSITION                    0x0000000E
#define _IFS2_CCP3IF_MASK                        0x00004000
#define _IFS2_CCP3IF_LENGTH                      0x00000001

#define _IFS2_CCT3IF_POSITION                    0x0000000F
#define _IFS2_CCT3IF_MASK                        0x00008000
#define _IFS2_CCT3IF_LENGTH                      0x00000001

